importedWeir/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    rightWall
    {
	type            omegaWallFunction;
        value           uniform 32;
    }
    leftWall
    {
	type		omegaWallFunction;
	value		uniform 32;
    }
    lowerWall
    {
	type		omegaWallFunction;
	value		uniform 32;
    }    
    frontAndBack
    {
	type            omegaWallFunction;
        value           uniform 32;
    }
    weir
    {
        type            omegaWallFunction;
        value           $internalField;

}


// ************************************************************************* //
